/*
SQLyog Ultimate - MySQL GUI v8.2 
MySQL - 5.5.27 : Database - itripdb
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`itripdb` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_unicode_ci */;

USE `itripdb`;

/*Table structure for table `itrip_travel` */

DROP TABLE IF EXISTS `itrip_travel`;

CREATE TABLE `itrip_travel` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `title` varchar(50) DEFAULT NULL,
  `schedule` varchar(50) DEFAULT NULL,
  `supplier` varchar(50) DEFAULT NULL,
  `citId` int(10) DEFAULT NULL,
  `price` decimal(10,2) DEFAULT NULL,
  `datails` text,
  `imageId` bigint(20) DEFAULT NULL,
  `comment` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8;

/*Data for the table `itrip_travel` */

insert  into `itrip_travel`(`id`,`title`,`schedule`,`supplier`,`citId`,`price`,`datails`,`imageId`,`comment`) values (2,'游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周二、三、四、五、六','苏打苏塔旅行社',2,'365.00','独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',990,1),(3,'北京1日自由行·八达岭长城＋十三陵定陵＋ 奥运场馆一日游','每周一、二、三、四、五、六','苏打苏塔旅行社',21,'158.00','带你领略京都之美。',991,1),(4,'test1北京1日自由行·八达岭长城＋十三陵定陵＋ 奥运场馆一日游','每周二、三、四、五、六','苏打苏塔旅行社',20,'158.00','xx带你领略京都之美。',992,1),(5,'test2游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周二、三、五、六','苏打苏塔旅行社',39,'655.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',993,1),(6,'游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景test3','每周一、二、三、四','苏打苏塔旅行社',40,'655.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',994,1),(7,'游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景test4','每周二、三、四、五、六','苏打苏塔旅行社',2,'655.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',995,2),(8,'test7北京1日自由行·八达岭长城＋十三陵定陵＋ 奥运场馆一日游','每周一、二、三、五、六','苏打苏塔旅行社',65,'158.00','xx带你领略京都之美。',992,2),(9,'游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景test5','每周二、三、四、五、六','苏打苏塔旅行社',81,'655.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',994,2),(10,'test8北京1日自由行·八达岭长城＋十三陵定陵＋ 奥运场馆一日游','每周二、三、四、五、六','苏打苏塔旅行社',90,'158.00','xx带你领略京都之美。',991,3),(11,'游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景test6','每周二、四、五、六','苏打苏塔旅行社',111,'655.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',990,3),(12,'test9北京1日自由行·八达岭长城＋十三陵定陵＋ 奥运场馆一日游','每周二、三、四、五、六','苏打苏塔旅行社',132,'158.00','xx带你领略京都之美。',990,3),(13,'test11游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周二、三、五、六','苏打苏塔旅行社',159,'435.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',990,4),(14,'test12游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周三、六','苏打苏塔旅行社',178,'234.00','深度全面的游览世界文化遗产，不留遗憾。',990,4),(15,'test13游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周二、三、五','苏打苏塔旅行社',191,'654.00','深度全面的游览世界文化遗产，不留遗憾。',994,4),(16,'test14游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周二、三、六','苏打苏塔旅行社',209,'134.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',995,4),(17,'test15游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周三、五、六','苏打苏塔旅行社',221,'664.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',993,5),(18,'test16北京5日4晚跟团游· 一价全含·无自费·含滑车圆明园','每周二、五、六','苏打苏塔旅行社',234,'888.00','深度全面的游览世界文化遗产，不留遗憾。',994,5),(19,'test17北京1日自由行·八达岭长城＋十三陵定陵＋ 奥运场馆一日游','每周二、三、四、五、六','苏打苏塔旅行社',235,'158.00','王府井长安街，吃喝玩乐旅游样样行。',992,5),(20,'test18北京5日自由行(4钻)·不含交通王府井四星+5折故宫门票+接送','每周二、三、五、六','苏打苏塔旅行社',247,'435.00','王府井长安街，吃喝玩乐旅游样样行。',995,5),(21,'test19游圣诞小镇密云1日自由行·南山滑雪畅玩+古北水镇夜景','每周三、六','苏打苏塔旅行社',260,'234.00','深度全面的游览世界文化遗产，不留遗憾。',992,5),(22,'test20北京5日自由行(4钻)·不含交通王府井四星+5折故宫门票+接送','每周二、三、五','苏打苏塔旅行社',290,'654.00','深度全面的游览世界文化遗产，不留遗憾。',990,5),(23,'test21北京5日自由行(4钻)·不含交通王府井四星+5折故宫门票+接送','每周二、三、六','苏打苏塔旅行社',298,'134.00','xx独览“全球不容错过的25处风景之首”，欣赏星空下的古北水镇迷人夜色',991,5),(24,'test22北京5日4晚跟团游· 一价全含·无自费·含滑车圆明园','每周三、五、六','苏打苏塔旅行社',326,'664.00','王府井长安街，吃喝玩乐旅游样样行。',994,5),(25,'test23北京5日4晚跟团游· 一价全含·无自费·含滑车圆明园','每周二、五、六','苏打苏塔旅行社',311,'888.00','深度全面的游览世界文化遗产，不留遗憾。',992,5);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
